'use strict'
let userAge = prompt('Введіть Вашу дату народження:'); // < --- Запитуємо дату народження користувача
let userCity = prompt('Введіть місто в якому Ви живете:');// < --- Місто де він живе
let userFavSport = prompt('Введіть Ваш улюблений вид спорту:');// < --- Улюблений вид спорту

const currentYear = (new Date).getFullYear();// < --- Змінна для отримання поточного року
let resultUserAge = currentYear - parseInt(userAge);// < --- Зміна для вирахування віку користувача

//Умова в якій буде виводити певний алерт при натисканні кнопки "Скасувати"
if(userAge === null || userCity === null || userFavSport === null){
    alert('Шкода, що Ви не захотіли ввести ' +
    (userAge === null ? 'свій рік народження' : (userCity === null ? 'своє місто' : 'вид спорту')) + '.');
} else{
    let cityInfo;// < --- Зміна для виводу інформації в алерті про місто користувача
    let champion;// < --- Зміна для виводу інформації користувачу в алерті про чемпіона, якщо він введе один із трьох обраних видів спорту
    let resultInfo;// < --- Зміна для виводу загальної інформації в алерті

//Умова, якщо клієнт введе конкретне місто або інше для виводу в загальному алерті
if (userCity === 'Київ'){
    cityInfo = 'Ти живеш у столиці України ';
} else if (userCity === 'Вашингтон'){
    cityInfo = 'Ти живеш у столиці США ';
} else if (userCity === 'Лондон'){
    cityInfo = 'Ти живеш у столиці Великої Британії ';
} else{
    cityInfo = 'Ти живеш у місті: ' + userCity;
};

//Умова, якщо клієнт введе конкретний вид спорту та що йому видасть в алерті, якщо він введе ці дані
if(userFavSport === 'Шахи'){
    champion = 'Магнус Карлсен';
} else if(userFavSport === 'Гольф'){
    champion = 'Тайґер Вудс';
} else if(userFavSport === 'Тенніс'){
    champion = 'Новак Джокович';
};

//Змінна для виводу загальної інформації в алерті
resultInfo = `Ваш вік: ${resultUserAge} 
${cityInfo} 
Улюблений вид спорту: ${userFavSport}`;
//Умова для виводу доп. інфо для користувача, якщо він введе конкретний вид спорту
if (champion){
resultInfo += `
Круто! Хочеш стати, як ${champion}? `;
};
        
alert(resultInfo);// < --- Загальний алерт
};